a = [
    [0,0,0,0],
    [0,0,0,0],
    [0,0,0,0],
    [0,0,0,0],
    [0,0,0,0],
    [0,0,0,0],
    [0,0,0,0],
    ]


def fun1():
    global a
    
    x = int(input("enter the number :"))
    if x == 1 :
        if a[0][0] == 0 :
            a[0][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 2 :
        if a[0][1] == 0 :
            a[0][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 3 :
        if a[0][2] == 0 :
            a[0][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 4 :
        if a[0][3] == 0 :
            a[0][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 5 :
        if a[1][0] == 0 :
            a[1][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 6 :
        if a[1][1] == 0 :
            a[1][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 7 :
        if a[1][2] == 0 :
            a[1][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 8 :
        if a[1][3] == 0 :
            a[1][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 9 :
        if a[2][0] == 0 :
            a[2][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 10 :
        if a[2][1] == 0 :
            a[2][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 11 :
        if a[2][2] == 0 :
            a[2][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 12 :
        if a[2][3] == 0 :
            a[2][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 13 :
        if a[3][0] == 0 :
            a[3][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 14 :
        if a[3][1] == 0 :
            a[3][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 15 :
        if a[3][2] == 0 :
            a[3][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 16 :
        if a[3][3] == 0 :
            a[3][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 17 :
        if a[4][0] == 0 :
            a[4][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 18 :
        if a[4][1] == 0 :
            a[4][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 19 :
        if a[4][2] == 0 :
            a[4][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 20 :
        if a[4][3] == 0 :
            a[4][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 21 :
        if a[5][0] == 0 :
            a[5][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 22 :
        if a[5][1] == 0 :
            a[5][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 23 :
        if a[5][2] == 0 :
            a[5][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 24 :
        if a[5][3] == 0 :
            a[5][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 25 :
        if a[6][0] == 0 :
            a[6][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 26 :
        if a[6][1] == 0 :
            a[6][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if x == 27 :
        if a[6][2] == 0 :
            a[6][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if x == 28 :
        if a[6][3] == 0 :
            a[6][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")


def fun2():
    d = int(input("enter the num"))
    global a
    global x

    if d == 1 :
        if a[0][0] == 0 :
            a[0][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 2 :
        if a[0][1] == 0 :
            a[0][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 3 :
        if a[0][2] == 0 :
            a[0][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 4 :
        if a[0][3] == 0 :
            a[0][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 5 :
        if a[1][0] == 0 :
            a[1][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 6 :
        if a[1][1] == 0 :
            a[1][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 7 :
        if a[1][2] == 0 :
            a[1][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 8 :
        if a[1][3] == 0 :
            a[1][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 9 :
        if a[2][0] == 0 :
            a[2][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 10 :
        if a[2][1] == 0 :
            a[2][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 11 :
        if a[2][2] == 0 :
            a[2][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 12 :
        if a[2][3] == 0 :
            a[2][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 13 :
        if a[3][0] == 0 :
            a[3][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 14 :
        if a[3][1] == 0 :
            a[3][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 15 :
        if a[3][2] == 0 :
            a[3][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 16 :
        if a[3][3] == 0 :
            a[3][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 17 :
        if a[4][0] == 0 :
            a[4][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 18 :
        if a[4][1] == 0 :
            a[4][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 19 :
        if a[4][2] == 0 :
            a[4][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 20 :
        if a[4][3] == 0 :
            a[4][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 21 :
        if a[5][0] == 0 :
            a[5][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 22 :
        if a[5][1] == 0 :
            a[5][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 23 :
        if a[5][2] == 0 :
            a[5][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 24 :
        if a[5][3] == 0 :
            a[5][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 25 :
        if a[6][0] == 0 :
            a[6][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 26 :
        if a[6][1] == 0 :
            a[6][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if d == 27 :
        if a[6][2] == 0 :
            a[6][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if d == 28 :
        if a[6][3] == 0 :
            a[6][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
def fun3():
    
    c = int(input("enter the num"))
    global a
    global x

    if c == 1 :
        if a[0][0] == 0 :
            a[0][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 2 :
        if a[0][1] == 0 :
            a[0][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 3 :
        if a[0][2] == 0 :
            a[0][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 4 :
        if a[0][3] == 0 :
            a[0][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 5 :
        if a[1][0] == 0 :
            a[1][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 6 :
        if a[1][1] == 0 :
            a[1][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 7 :
        if a[1][2] == 0 :
            a[1][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 8 :
        if a[1][3] == 0 :
            a[1][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 9 :
        if a[2][0] == 0 :
            a[2][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 10 :
        if a[2][1] == 0 :
            a[2][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 11 :
        if a[2][2] == 0 :
            a[2][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 12 :
        if a[2][3] == 0 :
            a[2][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 13 :
        if a[3][0] == 0 :
            a[3][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 14 :
        if a[3][1] == 0 :
            a[3][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 15 :
        if a[3][2] == 0 :
            a[3][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 16 :
        if a[3][3] == 0 :
            a[3][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 17 :
        if a[4][0] == 0 :
            a[4][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 18 :
        if a[4][1] == 0 :
            a[4][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 19 :
        if a[4][2] == 0 :
            a[4][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 20 :
        if a[4][3] == 0 :
            a[4][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 21 :
        if a[5][0] == 0 :
            a[5][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 22 :
        if a[5][1] == 0 :
            a[5][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 23 :
        if a[5][2] == 0 :
            a[5][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 24 :
        if a[5][3] == 0 :
            a[5][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 25 :
        if a[6][0] == 0 :
            a[6][0] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 26 :
        if a[6][1] == 0 :
            a[6][1] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
    if c == 27 :
        if a[6][2] == 0 :
            a[6][2] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف فهذا المقعد محجوز")
    if c == 28 :
        if a[6][3] == 0 :
            a[6][3] = 1
            print("تم حجز المقعد بنجاح ")
        else :
            print("للأسف قهذا المقعد محجوز")
def inputs():
    global a
    print("1. display ")
    print("2. add")
    print("3. exit")
    print("choice either 1 or 2 or 3 ")
    x = int(input("enter you choice"))
    if x == 1 :
        for i in a :
            print(i)
    if x == 2 :
        fun1()
        fun2()
        fun3()
    if x == 3 :
        exit()
    

     
inputs()
